hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_csi.h
/*
; stm32N657_csi.
; ==============

; SPDX-License-Identifier: MIT

;------------------------------------------------------------------------
; Author:	Generated using the .svd description	The 2025-01-01
; Modifs:
;
; Project:	uKOS-X
; Goal:		stm32N657_csi equates.
;
;   (c) 2025-2026, Edo. Franzi
;   --------------------------
;                                              __ ______  _____
;   Edo. Franzi                         __  __/ //_/ __ \/ ___/
;   5-Route de Cheseaux                / / / / ,< / / / /\__ \
;   CH 1400 Cheseaux-Noréaz           / /_/ / /| / /_/ /___/ /
;                                     \__,_/_/ |_\____//____/
;   edo.franzi@ukos.ch
;
;   Description: Lightweight, real-time multitasking operating
;   system for embedded microcontroller and DSP-based systems.
;
;   Permission is hereby granted, free of charge, to any person
;   obtaining a copy of this software and associated documentation
;   files (the "Software"), to deal in the Software without restriction,
;   including without limitation the rights to use, copy, modify,
;   merge, publish, distribute, sublicense, and/or sell copies of the
;   Software, and to permit persons to whom the Software is furnished
;   to do so, subject to the following conditions:
;
;   The above copyright notice and this permission notice shall be
;   included in all copies or substantial portions of the Software.
;
;   THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
;   EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
;   MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
;   NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS
;   BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN
;   ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
;   CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
;   SOFTWARE.
;
;------------------------------------------------------------------------
*/

#pragma	once

// CSI address definitions
// -----------------------

typedef struct {
	volatile	uint32_t	CR;
	volatile	uint32_t	PCR;
	volatile	uint32_t	RESERVED0[2];
	volatile	uint32_t	VC0CFGR1;
	volatile	uint32_t	VC0CFGR2;
	volatile	uint32_t	VC0CFGR3;
	volatile	uint32_t	VC0CFGR4;
	volatile	uint32_t	VC1CFGR1;
	volatile	uint32_t	VC1CFGR2;
	volatile	uint32_t	VC1CFGR3;
	volatile	uint32_t	VC1CFGR4;
	volatile	uint32_t	VC2CFGR1;
	volatile	uint32_t	VC2CFGR2;
	volatile	uint32_t	VC2CFGR3;
	volatile	uint32_t	VC2CFGR4;
	volatile	uint32_t	VC3CFGR1;
	volatile	uint32_t	VC3CFGR2;
	volatile	uint32_t	VC3CFGR3;
	volatile	uint32_t	VC3CFGR4;
	volatile	uint32_t	LB0CFGR;
	volatile	uint32_t	LB1CFGR;
	volatile	uint32_t	LB2CFGR;
	volatile	uint32_t	LB3CFGR;
	volatile	uint32_t	TIM0CFGR;
	volatile	uint32_t	TIM1CFGR;
	volatile	uint32_t	TIM2CFGR;
	volatile	uint32_t	TIM3CFGR;
	volatile	uint32_t	LMCFGR;
	volatile	uint32_t	PRGITR;
	volatile	uint32_t	WDR;
	volatile	uint32_t	RESERVED1;
	volatile	uint32_t	IER0;
	volatile	uint32_t	IER1;
	volatile	uint32_t	RESERVED2[2];
	volatile	uint32_t	SR0;
	volatile	uint32_t	SR1;
	volatile	uint32_t	RESERVED3[26];
	volatile	uint32_t	FCR0;
	volatile	uint32_t	FCR1;
	volatile	uint32_t	RESERVED4[2];
	volatile	uint32_t	SPDFR;
	volatile	uint32_t	ERR1;
	volatile	uint32_t	ERR2;
	volatile	uint32_t	RESERVED5[953];
	volatile	uint32_t	PRCR;
	volatile	uint32_t	PMCR;
	volatile	uint32_t	PFCR;
	volatile	uint32_t	RESERVED6;
	volatile	uint32_t	PTCR0;
	volatile	uint32_t	PTCR1;
	volatile	uint32_t	PTSR;
} CSI_TypeDef;

#if (defined(__cplusplus))
#define	CSI_NS	reinterpret_cast<CSI_TypeDef *>(0x48006000u)
#define	CSI_S	reinterpret_cast<CSI_TypeDef *>(0x58006000u)

#else
#define	CSI_NS	((CSI_TypeDef *)0x48006000u)
#define	CSI_S	((CSI_TypeDef *)0x58006000u)
#endif

// CR Configuration

#define	CSI_CR_VC3STOP					(0x1u<<15)
#define	CSI_CR_VC3START					(0x1u<<14)
#define	CSI_CR_VC2STOP					(0x1u<<11)
#define	CSI_CR_VC2START					(0x1u<<10)
#define	CSI_CR_VC1STOP					(0x1u<<7)
#define	CSI_CR_VC1START					(0x1u<<6)
#define	CSI_CR_VC0STOP					(0x1u<<3)
#define	CSI_CR_VC0START					(0x1u<<2)
#define	CSI_CR_CSIEN					(0x1u<<0)

#define	CSI_CR_VC3STOP_B_0X0			(0x0u<<15)
#define	CSI_CR_VC3STOP_B_0X1			(0x1u<<15)
#define	CSI_CR_VC3START_B_0X0			(0x0u<<14)
#define	CSI_CR_VC3START_B_0X1			(0x1u<<14)
#define	CSI_CR_VC2STOP_B_0X0			(0x0u<<11)
#define	CSI_CR_VC2STOP_B_0X1			(0x1u<<11)
#define	CSI_CR_VC2START_B_0X0			(0x0u<<10)
#define	CSI_CR_VC2START_B_0X1			(0x1u<<10)
#define	CSI_CR_VC1STOP_B_0X0			(0x0u<<7)
#define	CSI_CR_VC1STOP_B_0X1			(0x1u<<7)
#define	CSI_CR_VC1START_B_0X0			(0x0u<<6)
#define	CSI_CR_VC1START_B_0X1			(0x1u<<6)
#define	CSI_CR_VC0STOP_B_0X0			(0x0u<<3)
#define	CSI_CR_VC0STOP_B_0X1			(0x1u<<3)
#define	CSI_CR_VC0START_B_0X0			(0x0u<<2)
#define	CSI_CR_VC0START_B_0X1			(0x1u<<2)
#define	CSI_CR_CSIEN_B_0X0				(0x0u<<0)
#define	CSI_CR_CSIEN_B_0X1				(0x1u<<0)

// PCR Configuration

#define	CSI_PCR_DL1EN					(0x1u<<3)
#define	CSI_PCR_DL0EN					(0x1u<<2)
#define	CSI_PCR_CLEN					(0x1u<<1)
#define	CSI_PCR_PWRDOWN					(0x1u<<0)

#define	CSI_PCR_DL1EN_B_0X0				(0x0u<<3)
#define	CSI_PCR_DL1EN_B_0X1				(0x1u<<3)
#define	CSI_PCR_DL0EN_B_0X0				(0x0u<<2)
#define	CSI_PCR_DL0EN_B_0X1				(0x1u<<2)
#define	CSI_PCR_CLEN_B_0X0				(0x0u<<1)
#define	CSI_PCR_CLEN_B_0X1				(0x1u<<1)
#define	CSI_PCR_PWRDOWN_B_0X0			(0x0u<<0)
#define	CSI_PCR_PWRDOWN_B_0X1			(0x1u<<0)

// VC0CFGR1 Configuration

#define	CSI_VC0CFGR1_DT0FT				(0x1Fu<<24)
#define	CSI_VC0CFGR1_DT0FT_0			(0x1u<<24)
#define	CSI_VC0CFGR1_DT0				(0x3Fu<<16)
#define	CSI_VC0CFGR1_DT0_0				(0x1u<<16)
#define	CSI_VC0CFGR1_CDTFT				(0x1Fu<<8)
#define	CSI_VC0CFGR1_CDTFT_0			(0x1u<<8)
#define	CSI_VC0CFGR1_DT6EN				(0x1u<<7)
#define	CSI_VC0CFGR1_DT5EN				(0x1u<<6)
#define	CSI_VC0CFGR1_DT4EN				(0x1u<<5)
#define	CSI_VC0CFGR1_DT3EN				(0x1u<<4)
#define	CSI_VC0CFGR1_DT2EN				(0x1u<<3)
#define	CSI_VC0CFGR1_DT1EN				(0x1u<<2)
#define	CSI_VC0CFGR1_DT0EN				(0x1u<<1)
#define	CSI_VC0CFGR1_ALLDT				(0x1u<<0)

#define	CSI_VC0CFGR1_DT0FT_BPP6			(0x0u<<24)
#define	CSI_VC0CFGR1_DT0FT_BPP7			(0x1u<<24)
#define	CSI_VC0CFGR1_DT0FT_BPP8			(0x2u<<24)
#define	CSI_VC0CFGR1_DT0FT_BPP10		(0x3u<<24)
#define	CSI_VC0CFGR1_DT0FT_BPP12		(0x4u<<24)
#define	CSI_VC0CFGR1_DT0FT_BPP14		(0x5u<<24)
#define	CSI_VC0CFGR1_DT0FT_BPP16		(0x6u<<24)
#define	CSI_VC0CFGR1_CDTFT_BPP6			(0x0u<<8)
#define	CSI_VC0CFGR1_CDTFT_BPP7			(0x1u<<8)
#define	CSI_VC0CFGR1_CDTFT_BPP8			(0x2u<<8)
#define	CSI_VC0CFGR1_CDTFT_BPP10		(0x3u<<8)
#define	CSI_VC0CFGR1_CDTFT_BPP12		(0x4u<<8)
#define	CSI_VC0CFGR1_CDTFT_BPP14		(0x5u<<8)
#define	CSI_VC0CFGR1_CDTFT_BPP16		(0x6u<<8)
#define	CSI_VC0CFGR1_DT6EN_B_0X0		(0x0u<<7)
#define	CSI_VC0CFGR1_DT6EN_B_0X1		(0x1u<<7)
#define	CSI_VC0CFGR1_DT5EN_B_0X0		(0x0u<<6)
#define	CSI_VC0CFGR1_DT5EN_B_0X1		(0x1u<<6)
#define	CSI_VC0CFGR1_DT4EN_B_0X0		(0x0u<<5)
#define	CSI_VC0CFGR1_DT4EN_B_0X1		(0x1u<<5)
#define	CSI_VC0CFGR1_DT3EN_B_0X0		(0x0u<<4)
#define	CSI_VC0CFGR1_DT3EN_B_0X1		(0x1u<<4)
#define	CSI_VC0CFGR1_DT2EN_B_0X0		(0x0u<<3)
#define	CSI_VC0CFGR1_DT2EN_B_0X1		(0x1u<<3)
#define	CSI_VC0CFGR1_DT1EN_B_0X0		(0x0u<<2)
#define	CSI_VC0CFGR1_DT1EN_B_0X1		(0x1u<<2)
#define	CSI_VC0CFGR1_DT0EN_B_0X0		(0x0u<<1)
#define	CSI_VC0CFGR1_DT0EN_B_0X1		(0x1u<<1)
#define	CSI_VC0CFGR1_ALLDT_B_0X0		(0x0u<<0)
#define	CSI_VC0CFGR1_ALLDT_B_0X1		(0x1u<<0)

// VC0CFGR2 Configuration

#define	CSI_VC0CFGR2_DT2FT				(0x1Fu<<24)
#define	CSI_VC0CFGR2_DT2FT_0			(0x1u<<24)
#define	CSI_VC0CFGR2_DT2				(0x3Fu<<16)
#define	CSI_VC0CFGR2_DT2_0				(0x1u<<16)
#define	CSI_VC0CFGR2_DT1FT				(0x1Fu<<8)
#define	CSI_VC0CFGR2_DT1FT_0			(0x1u<<8)
#define	CSI_VC0CFGR2_DT1				(0x3Fu<<0)
#define	CSI_VC0CFGR2_DT1_0				(0x1u<<0)

#define	CSI_VC0CFGR2_DT2FT_BPP6			(0x0u<<24)
#define	CSI_VC0CFGR2_DT2FT_BPP7			(0x1u<<24)
#define	CSI_VC0CFGR2_DT2FT_BPP8			(0x2u<<24)
#define	CSI_VC0CFGR2_DT2FT_BPP10		(0x3u<<24)
#define	CSI_VC0CFGR2_DT2FT_BPP12		(0x4u<<24)
#define	CSI_VC0CFGR2_DT2FT_BPP14		(0x5u<<24)
#define	CSI_VC0CFGR2_DT2FT_BPP16		(0x6u<<24)
#define	CSI_VC0CFGR2_DT1FT_BPP6			(0x0u<<8)
#define	CSI_VC0CFGR2_DT1FT_BPP7			(0x1u<<8)
#define	CSI_VC0CFGR2_DT1FT_BPP8			(0x2u<<8)
#define	CSI_VC0CFGR2_DT1FT_BPP10		(0x3u<<8)
#define	CSI_VC0CFGR2_DT1FT_BPP12		(0x4u<<8)
#define	CSI_VC0CFGR2_DT1FT_BPP14		(0x5u<<8)
#define	CSI_VC0CFGR2_DT1FT_BPP16		(0x6u<<8)

// VC0CFGR3 Configuration

