hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_csi.h
#define	CSI_VC1CFGR4_DT6FT_BPP6			(0x0u<<24)
#define	CSI_VC1CFGR4_DT6FT_BPP7			(0x1u<<24)
#define	CSI_VC1CFGR4_DT6FT_BPP8			(0x2u<<24)
#define	CSI_VC1CFGR4_DT6FT_BPP10		(0x3u<<24)
#define	CSI_VC1CFGR4_DT6FT_BPP12		(0x4u<<24)
#define	CSI_VC1CFGR4_DT6FT_BPP14		(0x5u<<24)
#define	CSI_VC1CFGR4_DT6FT_BPP16		(0x6u<<24)
#define	CSI_VC1CFGR4_DT5FT_BPP6			(0x0u<<8)
#define	CSI_VC1CFGR4_DT5FT_BPP7			(0x1u<<8)
#define	CSI_VC1CFGR4_DT5FT_BPP8			(0x2u<<8)
#define	CSI_VC1CFGR4_DT5FT_BPP10		(0x3u<<8)
#define	CSI_VC1CFGR4_DT5FT_BPP12		(0x4u<<8)
#define	CSI_VC1CFGR4_DT5FT_BPP14		(0x5u<<8)
#define	CSI_VC1CFGR4_DT5FT_BPP16		(0x6u<<8)

// VC2CFGR1 Configuration

#define	CSI_VC2CFGR1_DT0FT				(0x1Fu<<24)
#define	CSI_VC2CFGR1_DT0FT_0			(0x1u<<24)
#define	CSI_VC2CFGR1_DT0				(0x3Fu<<16)
#define	CSI_VC2CFGR1_DT0_0				(0x1u<<16)
#define	CSI_VC2CFGR1_CDTFT				(0x1Fu<<8)
#define	CSI_VC2CFGR1_CDTFT_0			(0x1u<<8)
#define	CSI_VC2CFGR1_DT6EN				(0x1u<<7)
#define	CSI_VC2CFGR1_DT5EN				(0x1u<<6)
#define	CSI_VC2CFGR1_DT4EN				(0x1u<<5)
#define	CSI_VC2CFGR1_DT3EN				(0x1u<<4)
#define	CSI_VC2CFGR1_DT2EN				(0x1u<<3)
#define	CSI_VC2CFGR1_DT1EN				(0x1u<<2)
#define	CSI_VC2CFGR1_DT0EN				(0x1u<<1)
#define	CSI_VC2CFGR1_ALLDT				(0x1u<<0)

#define	CSI_VC2CFGR1_DT0FT_BPP6			(0x0u<<24)
#define	CSI_VC2CFGR1_DT0FT_BPP7			(0x1u<<24)
#define	CSI_VC2CFGR1_DT0FT_BPP8			(0x2u<<24)
#define	CSI_VC2CFGR1_DT0FT_BPP10		(0x3u<<24)
#define	CSI_VC2CFGR1_DT0FT_BPP12		(0x4u<<24)
#define	CSI_VC2CFGR1_DT0FT_BPP14		(0x5u<<24)
#define	CSI_VC2CFGR1_DT0FT_BPP16		(0x6u<<24)
#define	CSI_VC2CFGR1_CDTFT_BPP6			(0x0u<<8)
#define	CSI_VC2CFGR1_CDTFT_BPP7			(0x1u<<8)
#define	CSI_VC2CFGR1_CDTFT_BPP8			(0x2u<<8)
#define	CSI_VC2CFGR1_CDTFT_BPP10		(0x3u<<8)
#define	CSI_VC2CFGR1_CDTFT_BPP12		(0x4u<<8)
#define	CSI_VC2CFGR1_CDTFT_BPP14		(0x5u<<8)
#define	CSI_VC2CFGR1_CDTFT_BPP16		(0x6u<<8)
#define	CSI_VC2CFGR1_DT6EN_B_0X0		(0x0u<<7)
#define	CSI_VC2CFGR1_DT6EN_B_0X1		(0x1u<<7)
#define	CSI_VC2CFGR1_DT5EN_B_0X0		(0x0u<<6)
#define	CSI_VC2CFGR1_DT5EN_B_0X1		(0x1u<<6)
#define	CSI_VC2CFGR1_DT4EN_B_0X0		(0x0u<<5)
#define	CSI_VC2CFGR1_DT4EN_B_0X1		(0x1u<<5)
#define	CSI_VC2CFGR1_DT3EN_B_0X0		(0x0u<<4)
#define	CSI_VC2CFGR1_DT3EN_B_0X1		(0x1u<<4)
#define	CSI_VC2CFGR1_DT2EN_B_0X0		(0x0u<<3)
#define	CSI_VC2CFGR1_DT2EN_B_0X1		(0x1u<<3)
#define	CSI_VC2CFGR1_DT1EN_B_0X0		(0x0u<<2)
#define	CSI_VC2CFGR1_DT1EN_B_0X1		(0x1u<<2)
#define	CSI_VC2CFGR1_DT0EN_B_0X0		(0x0u<<1)
#define	CSI_VC2CFGR1_DT0EN_B_0X1		(0x1u<<1)
#define	CSI_VC2CFGR1_ALLDT_B_0X0		(0x0u<<0)
#define	CSI_VC2CFGR1_ALLDT_B_0X1		(0x1u<<0)

// VC2CFGR2 Configuration

#define	CSI_VC2CFGR2_DT2FT				(0x1Fu<<24)
#define	CSI_VC2CFGR2_DT2FT_0			(0x1u<<24)
#define	CSI_VC2CFGR2_DT2				(0x3Fu<<16)
#define	CSI_VC2CFGR2_DT2_0				(0x1u<<16)
#define	CSI_VC2CFGR2_DT1FT				(0x1Fu<<8)
#define	CSI_VC2CFGR2_DT1FT_0			(0x1u<<8)
#define	CSI_VC2CFGR2_DT1				(0x3Fu<<0)
#define	CSI_VC2CFGR2_DT1_0				(0x1u<<0)

#define	CSI_VC2CFGR2_DT2FT_BPP6			(0x0u<<24)
#define	CSI_VC2CFGR2_DT2FT_BPP7			(0x1u<<24)
#define	CSI_VC2CFGR2_DT2FT_BPP8			(0x2u<<24)
#define	CSI_VC2CFGR2_DT2FT_BPP10		(0x3u<<24)
#define	CSI_VC2CFGR2_DT2FT_BPP12		(0x4u<<24)
#define	CSI_VC2CFGR2_DT2FT_BPP14		(0x5u<<24)
#define	CSI_VC2CFGR2_DT2FT_BPP16		(0x6u<<24)
#define	CSI_VC2CFGR2_DT1FT_BPP6			(0x0u<<8)
#define	CSI_VC2CFGR2_DT1FT_BPP7			(0x1u<<8)
#define	CSI_VC2CFGR2_DT1FT_BPP8			(0x2u<<8)
#define	CSI_VC2CFGR2_DT1FT_BPP10		(0x3u<<8)
#define	CSI_VC2CFGR2_DT1FT_BPP12		(0x4u<<8)
#define	CSI_VC2CFGR2_DT1FT_BPP14		(0x5u<<8)
#define	CSI_VC2CFGR2_DT1FT_BPP16		(0x6u<<8)

// VC2CFGR3 Configuration

#define	CSI_VC2CFGR3_DT4FT				(0x1Fu<<24)
#define	CSI_VC2CFGR3_DT4FT_0			(0x1u<<24)
#define	CSI_VC2CFGR3_DT4				(0x3Fu<<16)
#define	CSI_VC2CFGR3_DT4_0				(0x1u<<16)
#define	CSI_VC2CFGR3_DT3FT				(0x1Fu<<8)
#define	CSI_VC2CFGR3_DT3FT_0			(0x1u<<8)
#define	CSI_VC2CFGR3_DT3				(0x3Fu<<0)
#define	CSI_VC2CFGR3_DT3_0				(0x1u<<0)

#define	CSI_VC2CFGR3_DT4FT_BPP6			(0x0u<<24)
#define	CSI_VC2CFGR3_DT4FT_BPP7			(0x1u<<24)
#define	CSI_VC2CFGR3_DT4FT_BPP8			(0x2u<<24)
#define	CSI_VC2CFGR3_DT4FT_BPP10		(0x3u<<24)
#define	CSI_VC2CFGR3_DT4FT_BPP12		(0x4u<<24)
#define	CSI_VC2CFGR3_DT4FT_BPP14		(0x5u<<24)
#define	CSI_VC2CFGR3_DT4FT_BPP16		(0x6u<<24)
#define	CSI_VC2CFGR3_DT3FT_BPP6			(0x0u<<8)
#define	CSI_VC2CFGR3_DT3FT_BPP7			(0x1u<<8)
#define	CSI_VC2CFGR3_DT3FT_BPP8			(0x2u<<8)
#define	CSI_VC2CFGR3_DT3FT_BPP10		(0x3u<<8)
#define	CSI_VC2CFGR3_DT3FT_BPP12		(0x4u<<8)
#define	CSI_VC2CFGR3_DT3FT_BPP14		(0x5u<<8)
#define	CSI_VC2CFGR3_DT3FT_BPP16		(0x6u<<8)

// VC2CFGR4 Configuration

#define	CSI_VC2CFGR4_DT6FT				(0x1Fu<<24)
#define	CSI_VC2CFGR4_DT6FT_0			(0x1u<<24)
#define	CSI_VC2CFGR4_DT6				(0x3Fu<<16)
#define	CSI_VC2CFGR4_DT6_0				(0x1u<<16)
#define	CSI_VC2CFGR4_DT5FT				(0x1Fu<<8)
#define	CSI_VC2CFGR4_DT5FT_0			(0x1u<<8)
#define	CSI_VC2CFGR4_DT5				(0x3Fu<<0)
#define	CSI_VC2CFGR4_DT5_0				(0x1u<<0)

#define	CSI_VC2CFGR4_DT6FT_BPP6			(0x0u<<24)
#define	CSI_VC2CFGR4_DT6FT_BPP7			(0x1u<<24)
#define	CSI_VC2CFGR4_DT6FT_BPP8			(0x2u<<24)
#define	CSI_VC2CFGR4_DT6FT_BPP10		(0x3u<<24)
#define	CSI_VC2CFGR4_DT6FT_BPP12		(0x4u<<24)
#define	CSI_VC2CFGR4_DT6FT_BPP14		(0x5u<<24)
#define	CSI_VC2CFGR4_DT6FT_BPP16		(0x6u<<24)
#define	CSI_VC2CFGR4_DT5FT_BPP6			(0x0u<<8)
#define	CSI_VC2CFGR4_DT5FT_BPP7			(0x1u<<8)
#define	CSI_VC2CFGR4_DT5FT_BPP8			(0x2u<<8)
#define	CSI_VC2CFGR4_DT5FT_BPP10		(0x3u<<8)
#define	CSI_VC2CFGR4_DT5FT_BPP12		(0x4u<<8)
#define	CSI_VC2CFGR4_DT5FT_BPP14		(0x5u<<8)
#define	CSI_VC2CFGR4_DT5FT_BPP16		(0x6u<<8)

// VC3CFGR1 Configuration

#define	CSI_VC3CFGR1_DT0FT				(0x1Fu<<24)
#define	CSI_VC3CFGR1_DT0FT_0			(0x1u<<24)
#define	CSI_VC3CFGR1_DT0				(0x3Fu<<16)
#define	CSI_VC3CFGR1_DT0_0				(0x1u<<16)
#define	CSI_VC3CFGR1_CDTFT				(0x1Fu<<8)
#define	CSI_VC3CFGR1_CDTFT_0			(0x1u<<8)
#define	CSI_VC3CFGR1_DT6EN				(0x1u<<7)
#define	CSI_VC3CFGR1_DT5EN				(0x1u<<6)
#define	CSI_VC3CFGR1_DT4EN				(0x1u<<5)
#define	CSI_VC3CFGR1_DT3EN				(0x1u<<4)
#define	CSI_VC3CFGR1_DT2EN				(0x1u<<3)
#define	CSI_VC3CFGR1_DT1EN				(0x1u<<2)
#define	CSI_VC3CFGR1_DT0EN				(0x1u<<1)
#define	CSI_VC3CFGR1_ALLDT				(0x1u<<0)

#define	CSI_VC3CFGR1_DT0FT_BPP6			(0x0u<<24)
#define	CSI_VC3CFGR1_DT0FT_BPP7			(0x1u<<24)
#define	CSI_VC3CFGR1_DT0FT_BPP8			(0x2u<<24)
#define	CSI_VC3CFGR1_DT0FT_BPP10		(0x3u<<24)
#define	CSI_VC3CFGR1_DT0FT_BPP12		(0x4u<<24)
#define	CSI_VC3CFGR1_DT0FT_BPP14		(0x5u<<24)
#define	CSI_VC3CFGR1_DT0FT_BPP16		(0x6u<<24)
#define	CSI_VC3CFGR1_CDTFT_BPP6			(0x0u<<8)
#define	CSI_VC3CFGR1_CDTFT_BPP7			(0x1u<<8)
#define	CSI_VC3CFGR1_CDTFT_BPP8			(0x2u<<8)
#define	CSI_VC3CFGR1_CDTFT_BPP10		(0x3u<<8)
#define	CSI_VC3CFGR1_CDTFT_BPP12		(0x4u<<8)
#define	CSI_VC3CFGR1_CDTFT_BPP14		(0x5u<<8)
#define	CSI_VC3CFGR1_CDTFT_BPP16		(0x6u<<8)
#define	CSI_VC3CFGR1_DT6EN_B_0X0		(0x0u<<7)
#define	CSI_VC3CFGR1_DT6EN_B_0X1		(0x1u<<7)
#define	CSI_VC3CFGR1_DT5EN_B_0X0		(0x0u<<6)
#define	CSI_VC3CFGR1_DT5EN_B_0X1		(0x1u<<6)
#define	CSI_VC3CFGR1_DT4EN_B_0X0		(0x0u<<5)
#define	CSI_VC3CFGR1_DT4EN_B_0X1		(0x1u<<5)
#define	CSI_VC3CFGR1_DT3EN_B_0X0		(0x0u<<4)
#define	CSI_VC3CFGR1_DT3EN_B_0X1		(0x1u<<4)
#define	CSI_VC3CFGR1_DT2EN_B_0X0		(0x0u<<3)
#define	CSI_VC3CFGR1_DT2EN_B_0X1		(0x1u<<3)
#define	CSI_VC3CFGR1_DT1EN_B_0X0		(0x0u<<2)
#define	CSI_VC3CFGR1_DT1EN_B_0X1		(0x1u<<2)
#define	CSI_VC3CFGR1_DT0EN_B_0X0		(0x0u<<1)
#define	CSI_VC3CFGR1_DT0EN_B_0X1		(0x1u<<1)
#define	CSI_VC3CFGR1_ALLDT_B_0X0		(0x0u<<0)
#define	CSI_VC3CFGR1_ALLDT_B_0X1		(0x1u<<0)

// VC3CFGR2 Configuration

#define	CSI_VC3CFGR2_DT2FT				(0x1Fu<<24)
#define	CSI_VC3CFGR2_DT2FT_0			(0x1u<<24)
#define	CSI_VC3CFGR2_DT2				(0x3Fu<<16)
#define	CSI_VC3CFGR2_DT2_0				(0x1u<<16)
#define	CSI_VC3CFGR2_DT1FT				(0x1Fu<<8)
#define	CSI_VC3CFGR2_DT1FT_0			(0x1u<<8)
#define	CSI_VC3CFGR2_DT1				(0x3Fu<<0)
#define	CSI_VC3CFGR2_DT1_0				(0x1u<<0)

#define	CSI_VC3CFGR2_DT2FT_BPP6			(0x0u<<24)
#define	CSI_VC3CFGR2_DT2FT_BPP7			(0x1u<<24)
#define	CSI_VC3CFGR2_DT2FT_BPP8			(0x2u<<24)
#define	CSI_VC3CFGR2_DT2FT_BPP10		(0x3u<<24)
#define	CSI_VC3CFGR2_DT2FT_BPP12		(0x4u<<24)
#define	CSI_VC3CFGR2_DT2FT_BPP14		(0x5u<<24)
#define	CSI_VC3CFGR2_DT2FT_BPP16		(0x6u<<24)
#define	CSI_VC3CFGR2_DT1FT_BPP6			(0x0u<<8)
#define	CSI_VC3CFGR2_DT1FT_BPP7			(0x1u<<8)
#define	CSI_VC3CFGR2_DT1FT_BPP8			(0x2u<<8)
#define	CSI_VC3CFGR2_DT1FT_BPP10		(0x3u<<8)
#define	CSI_VC3CFGR2_DT1FT_BPP12		(0x4u<<8)
#define	CSI_VC3CFGR2_DT1FT_BPP14		(0x5u<<8)
#define	CSI_VC3CFGR2_DT1FT_BPP16		(0x6u<<8)

// VC3CFGR3 Configuration

#define	CSI_VC3CFGR3_DT4FT				(0x1Fu<<24)
#define	CSI_VC3CFGR3_DT4FT_0			(0x1u<<24)
#define	CSI_VC3CFGR3_DT4				(0x3Fu<<16)
#define	CSI_VC3CFGR3_DT4_0				(0x1u<<16)
#define	CSI_VC3CFGR3_DT3FT				(0x1Fu<<8)
#define	CSI_VC3CFGR3_DT3FT_0			(0x1u<<8)
#define	CSI_VC3CFGR3_DT3				(0x3Fu<<0)
#define	CSI_VC3CFGR3_DT3_0				(0x1u<<0)

#define	CSI_VC3CFGR3_DT4FT_BPP6			(0x0u<<24)
#define	CSI_VC3CFGR3_DT4FT_BPP7			(0x1u<<24)
#define	CSI_VC3CFGR3_DT4FT_BPP8			(0x2u<<24)
#define	CSI_VC3CFGR3_DT4FT_BPP10		(0x3u<<24)
#define	CSI_VC3CFGR3_DT4FT_BPP12		(0x4u<<24)
#define	CSI_VC3CFGR3_DT4FT_BPP14		(0x5u<<24)
#define	CSI_VC3CFGR3_DT4FT_BPP16		(0x6u<<24)
#define	CSI_VC3CFGR3_DT3FT_BPP6			(0x0u<<8)
#define	CSI_VC3CFGR3_DT3FT_BPP7			(0x1u<<8)
#define	CSI_VC3CFGR3_DT3FT_BPP8			(0x2u<<8)
#define	CSI_VC3CFGR3_DT3FT_BPP10		(0x3u<<8)
#define	CSI_VC3CFGR3_DT3FT_BPP12		(0x4u<<8)
#define	CSI_VC3CFGR3_DT3FT_BPP14		(0x5u<<8)
#define	CSI_VC3CFGR3_DT3FT_BPP16		(0x6u<<8)

// VC3CFGR4 Configuration

