hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_csi.h
#define	CSI_VC3CFGR4_DT6FT				(0x1Fu<<24)
#define	CSI_VC3CFGR4_DT6FT_0			(0x1u<<24)
#define	CSI_VC3CFGR4_DT6				(0x3Fu<<16)
#define	CSI_VC3CFGR4_DT6_0				(0x1u<<16)
#define	CSI_VC3CFGR4_DT5FT				(0x1Fu<<8)
#define	CSI_VC3CFGR4_DT5FT_0			(0x1u<<8)
#define	CSI_VC3CFGR4_DT5				(0x3Fu<<0)
#define	CSI_VC3CFGR4_DT5_0				(0x1u<<0)

#define	CSI_VC3CFGR4_DT6FT_BPP6			(0x0u<<24)
#define	CSI_VC3CFGR4_DT6FT_BPP7			(0x1u<<24)
#define	CSI_VC3CFGR4_DT6FT_BPP8			(0x2u<<24)
#define	CSI_VC3CFGR4_DT6FT_BPP10		(0x3u<<24)
#define	CSI_VC3CFGR4_DT6FT_BPP12		(0x4u<<24)
#define	CSI_VC3CFGR4_DT6FT_BPP14		(0x5u<<24)
#define	CSI_VC3CFGR4_DT6FT_BPP16		(0x6u<<24)
#define	CSI_VC3CFGR4_DT5FT_BPP6			(0x0u<<8)
#define	CSI_VC3CFGR4_DT5FT_BPP7			(0x1u<<8)
#define	CSI_VC3CFGR4_DT5FT_BPP8			(0x2u<<8)
#define	CSI_VC3CFGR4_DT5FT_BPP10		(0x3u<<8)
#define	CSI_VC3CFGR4_DT5FT_BPP12		(0x4u<<8)
#define	CSI_VC3CFGR4_DT5FT_BPP14		(0x5u<<8)
#define	CSI_VC3CFGR4_DT5FT_BPP16		(0x6u<<8)

// LB0CFGR Configuration

#define	CSI_LB0CFGR_LINECNT				(0xFFFFu<<16)
#define	CSI_LB0CFGR_LINECNT_0			(0x1u<<16)
#define	CSI_LB0CFGR_BYTECNT				(0xFFFFu<<0)
#define	CSI_LB0CFGR_BYTECNT_0			(0x1u<<0)

// LB1CFGR Configuration

#define	CSI_LB1CFGR_LINECNT				(0xFFFFu<<16)
#define	CSI_LB1CFGR_LINECNT_0			(0x1u<<16)
#define	CSI_LB1CFGR_BYTECNT				(0xFFFFu<<0)
#define	CSI_LB1CFGR_BYTECNT_0			(0x1u<<0)

// LB2CFGR Configuration

#define	CSI_LB2CFGR_LINECNT				(0xFFFFu<<16)
#define	CSI_LB2CFGR_LINECNT_0			(0x1u<<16)
#define	CSI_LB2CFGR_BYTECNT				(0xFFFFu<<0)
#define	CSI_LB2CFGR_BYTECNT_0			(0x1u<<0)

// LB3CFGR Configuration

#define	CSI_LB3CFGR_LINECNT				(0xFFFFu<<16)
#define	CSI_LB3CFGR_LINECNT_0			(0x1u<<16)
#define	CSI_LB3CFGR_BYTECNT				(0xFFFFu<<0)
#define	CSI_LB3CFGR_BYTECNT_0			(0x1u<<0)

// TIM0CFGR Configuration

#define	CSI_TIM0CFGR_COUNT				(0x1FFFFFFu<<0)
#define	CSI_TIM0CFGR_COUNT_0			(0x1u<<0)

// TIM1CFGR Configuration

#define	CSI_TIM1CFGR_COUNT				(0x1FFFFFFu<<0)
#define	CSI_TIM1CFGR_COUNT_0			(0x1u<<0)

// TIM2CFGR Configuration

#define	CSI_TIM2CFGR_COUNT				(0x1FFFFFFu<<0)
#define	CSI_TIM2CFGR_COUNT_0			(0x1u<<0)

// TIM3CFGR Configuration

#define	CSI_TIM3CFGR_COUNT				(0x1FFFFFFu<<0)
#define	CSI_TIM3CFGR_COUNT_0			(0x1u<<0)

// LMCFGR Configuration

#define	CSI_LMCFGR_DL1MAP				(0x7u<<20)
#define	CSI_LMCFGR_DL1MAP_0				(0x1u<<20)
#define	CSI_LMCFGR_DL0MAP				(0x7u<<16)
#define	CSI_LMCFGR_DL0MAP_0				(0x1u<<16)
#define	CSI_LMCFGR_LANENB				(0x7u<<8)
#define	CSI_LMCFGR_LANENB_0				(0x1u<<8)

#define	CSI_LMCFGR_DL1MAP_B_0X1			(0x1u<<20)
#define	CSI_LMCFGR_DL1MAP_B_0X2			(0x2u<<20)
#define	CSI_LMCFGR_DL0MAP_B_0X1			(0x1u<<16)
#define	CSI_LMCFGR_DL0MAP_B_0X2			(0x2u<<16)
#define	CSI_LMCFGR_LANENB_B_0X1			(0x1u<<8)
#define	CSI_LMCFGR_LANENB_B_0X2			(0x2u<<8)

// PRGITR Configuration

#define	CSI_PRGITR_TIM3EN				(0x1u<<31)
#define	CSI_PRGITR_TIM3EOF				(0x1u<<30)
#define	CSI_PRGITR_TIM3VC				(0x3u<<28)
#define	CSI_PRGITR_TIM3VC_0				(0x1u<<28)
#define	CSI_PRGITR_TIM2EN				(0x1u<<27)
#define	CSI_PRGITR_TIM2EOF				(0x1u<<26)
#define	CSI_PRGITR_TIM2VC				(0x3u<<24)
#define	CSI_PRGITR_TIM2VC_0				(0x1u<<24)
#define	CSI_PRGITR_TIM1EN				(0x1u<<23)
#define	CSI_PRGITR_TIM1EOF				(0x1u<<22)
#define	CSI_PRGITR_TIM1VC				(0x3u<<20)
#define	CSI_PRGITR_TIM1VC_0				(0x1u<<20)
#define	CSI_PRGITR_TIM0EN				(0x1u<<19)
#define	CSI_PRGITR_TIM0EOF				(0x1u<<18)
#define	CSI_PRGITR_TIM0VC				(0x3u<<16)
#define	CSI_PRGITR_TIM0VC_0				(0x1u<<16)
#define	CSI_PRGITR_LB3EN				(0x1u<<15)
#define	CSI_PRGITR_LB3VC				(0x3u<<12)
#define	CSI_PRGITR_LB3VC_0				(0x1u<<12)
#define	CSI_PRGITR_LB2EN				(0x1u<<11)
#define	CSI_PRGITR_LB2VC				(0x3u<<8)
#define	CSI_PRGITR_LB2VC_0				(0x1u<<8)
#define	CSI_PRGITR_LB1EN				(0x1u<<7)
#define	CSI_PRGITR_LB1VC				(0x3u<<4)
#define	CSI_PRGITR_LB1VC_0				(0x1u<<4)
#define	CSI_PRGITR_LB0EN				(0x1u<<3)
#define	CSI_PRGITR_LB0VC				(0x3u<<0)
#define	CSI_PRGITR_LB0VC_0				(0x1u<<0)

#define	CSI_PRGITR_TIM3EN_B_0X0			(0x0u<<31)
#define	CSI_PRGITR_TIM3EN_B_0X1			(0x1u<<31)
#define	CSI_PRGITR_TIM3EOF_B_0X0		(0x0u<<30)
#define	CSI_PRGITR_TIM3EOF_B_0X1		(0x1u<<30)
#define	CSI_PRGITR_TIM3VC_B_0X0			(0x0u<<28)
#define	CSI_PRGITR_TIM3VC_B_0X1			(0x1u<<28)
#define	CSI_PRGITR_TIM3VC_B_0X2			(0x2u<<28)
#define	CSI_PRGITR_TIM3VC_B_0X3			(0x3u<<28)
#define	CSI_PRGITR_TIM2EN_B_0X0			(0x0u<<27)
#define	CSI_PRGITR_TIM2EN_B_0X1			(0x1u<<27)
#define	CSI_PRGITR_TIM2EOF_B_0X0		(0x0u<<26)
#define	CSI_PRGITR_TIM2EOF_B_0X1		(0x1u<<26)
#define	CSI_PRGITR_TIM2VC_B_0X0			(0x0u<<24)
#define	CSI_PRGITR_TIM2VC_B_0X1			(0x1u<<24)
#define	CSI_PRGITR_TIM2VC_B_0X2			(0x2u<<24)
#define	CSI_PRGITR_TIM2VC_B_0X3			(0x3u<<24)
#define	CSI_PRGITR_TIM1EN_B_0X0			(0x0u<<23)
#define	CSI_PRGITR_TIM1EN_B_0X1			(0x1u<<23)
#define	CSI_PRGITR_TIM1EOF_B_0X0		(0x0u<<22)
#define	CSI_PRGITR_TIM1EOF_B_0X1		(0x1u<<22)
#define	CSI_PRGITR_TIM1VC_B_0X0			(0x0u<<20)
#define	CSI_PRGITR_TIM1VC_B_0X1			(0x1u<<20)
#define	CSI_PRGITR_TIM1VC_B_0X2			(0x2u<<20)
#define	CSI_PRGITR_TIM1VC_B_0X3			(0x3u<<20)
#define	CSI_PRGITR_TIM0EN_B_0X0			(0x0u<<19)
#define	CSI_PRGITR_TIM0EN_B_0X1			(0x1u<<19)
#define	CSI_PRGITR_TIM0EOF_B_0X0		(0x0u<<18)
#define	CSI_PRGITR_TIM0EOF_B_0X1		(0x1u<<18)
#define	CSI_PRGITR_TIM0VC_B_0X0			(0x0u<<16)
#define	CSI_PRGITR_TIM0VC_B_0X1			(0x1u<<16)
#define	CSI_PRGITR_TIM0VC_B_0X2			(0x2u<<16)
#define	CSI_PRGITR_TIM0VC_B_0X3			(0x3u<<16)
#define	CSI_PRGITR_LB3EN_B_0X0			(0x0u<<15)
#define	CSI_PRGITR_LB3EN_B_0X1			(0x1u<<15)
#define	CSI_PRGITR_LB3VC_B_0X0			(0x0u<<12)
#define	CSI_PRGITR_LB3VC_B_0X1			(0x1u<<12)
#define	CSI_PRGITR_LB3VC_B_0X2			(0x2u<<12)
#define	CSI_PRGITR_LB3VC_B_0X3			(0x3u<<12)
#define	CSI_PRGITR_LB2EN_B_0X0			(0x0u<<11)
#define	CSI_PRGITR_LB2EN_B_0X1			(0x1u<<11)
#define	CSI_PRGITR_LB2VC_B_0X0			(0x0u<<8)
#define	CSI_PRGITR_LB2VC_B_0X1			(0x1u<<8)
#define	CSI_PRGITR_LB2VC_B_0X2			(0x2u<<8)
#define	CSI_PRGITR_LB2VC_B_0X3			(0x3u<<8)
#define	CSI_PRGITR_LB1EN_B_0X0			(0x0u<<7)
#define	CSI_PRGITR_LB1EN_B_0X1			(0x1u<<7)
#define	CSI_PRGITR_LB1VC_B_0X0			(0x0u<<4)
#define	CSI_PRGITR_LB1VC_B_0X1			(0x1u<<4)
#define	CSI_PRGITR_LB1VC_B_0X2			(0x2u<<4)
#define	CSI_PRGITR_LB1VC_B_0X3			(0x3u<<4)
#define	CSI_PRGITR_LB0EN_B_0X0			(0x0u<<3)
#define	CSI_PRGITR_LB0EN_B_0X1			(0x1u<<3)
#define	CSI_PRGITR_LB0VC_B_0X0			(0x0u<<0)
#define	CSI_PRGITR_LB0VC_B_0X1			(0x1u<<0)
#define	CSI_PRGITR_LB0VC_B_0X2			(0x2u<<0)
#define	CSI_PRGITR_LB0VC_B_0X3			(0x3u<<0)

// WDR Configuration

#define	CSI_WDR_CNT						(0xFFFFFFFFu<<0)
#define	CSI_WDR_CNT_0					(0x1u<<0)

