hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_csi.h
// IER0 Configuration

#define	CSI_IER0_SYNCERRIE				(0x1u<<30)
#define	CSI_IER0_WDERRIE				(0x1u<<29)
#define	CSI_IER0_SPKTERRIE				(0x1u<<28)
#define	CSI_IER0_IDERRIE				(0x1u<<27)
#define	CSI_IER0_CECCERRIE				(0x1u<<26)
#define	CSI_IER0_ECCERRIE				(0x1u<<25)
#define	CSI_IER0_CRCERRIE				(0x1u<<24)
#define	CSI_IER0_CCFIFOFIE				(0x1u<<21)
#define	CSI_IER0_SPKTIE					(0x1u<<16)
#define	CSI_IER0_EOF3IE					(0x1u<<15)
#define	CSI_IER0_EOF2IE					(0x1u<<14)
#define	CSI_IER0_EOF1IE					(0x1u<<13)
#define	CSI_IER0_EOF0IE					(0x1u<<12)
#define	CSI_IER0_SOF3IE					(0x1u<<11)
#define	CSI_IER0_SOF2IE					(0x1u<<10)
#define	CSI_IER0_SOF1IE					(0x1u<<9)
#define	CSI_IER0_SOF0IE					(0x1u<<8)
#define	CSI_IER0_TIM3IE					(0x1u<<7)
#define	CSI_IER0_TIM2IE					(0x1u<<6)
#define	CSI_IER0_TIM1IE					(0x1u<<5)
#define	CSI_IER0_TIM0IE					(0x1u<<4)
#define	CSI_IER0_LB3IE					(0x1u<<3)
#define	CSI_IER0_LB2IE					(0x1u<<2)
#define	CSI_IER0_LB1IE					(0x1u<<1)
#define	CSI_IER0_LB0IE					(0x1u<<0)

#define	CSI_IER0_SYNCERRIE_B_0X0		(0x0u<<30)
#define	CSI_IER0_SYNCERRIE_B_0X1		(0x1u<<30)
#define	CSI_IER0_WDERRIE_B_0X0			(0x0u<<29)
#define	CSI_IER0_WDERRIE_B_0X1			(0x1u<<29)
#define	CSI_IER0_SPKTERRIE_B_0X0		(0x0u<<28)
#define	CSI_IER0_SPKTERRIE_B_0X1		(0x1u<<28)
#define	CSI_IER0_IDERRIE_B_0X0			(0x0u<<27)
#define	CSI_IER0_IDERRIE_B_0X1			(0x1u<<27)
#define	CSI_IER0_CECCERRIE_B_0X0		(0x0u<<26)
#define	CSI_IER0_CECCERRIE_B_0X1		(0x1u<<26)
#define	CSI_IER0_ECCERRIE_B_0X0			(0x0u<<25)
#define	CSI_IER0_ECCERRIE_B_0X1			(0x1u<<25)
#define	CSI_IER0_CRCERRIE_B_0X0			(0x0u<<24)
#define	CSI_IER0_CRCERRIE_B_0X1			(0x1u<<24)
#define	CSI_IER0_CCFIFOFIE_B_0X0		(0x0u<<21)
#define	CSI_IER0_CCFIFOFIE_B_0X1		(0x1u<<21)
#define	CSI_IER0_SPKTIE_B_0X0			(0x0u<<16)
#define	CSI_IER0_SPKTIE_B_0X1			(0x1u<<16)
#define	CSI_IER0_EOF3IE_B_0X0			(0x0u<<15)
#define	CSI_IER0_EOF3IE_B_0X1			(0x1u<<15)
#define	CSI_IER0_EOF2IE_B_0X0			(0x0u<<14)
#define	CSI_IER0_EOF2IE_B_0X1			(0x1u<<14)
#define	CSI_IER0_EOF1IE_B_0X0			(0x0u<<13)
#define	CSI_IER0_EOF1IE_B_0X1			(0x1u<<13)
#define	CSI_IER0_EOF0IE_B_0X0			(0x0u<<12)
#define	CSI_IER0_EOF0IE_B_0X1			(0x1u<<12)
#define	CSI_IER0_SOF3IE_B_0X0			(0x0u<<11)
#define	CSI_IER0_SOF3IE_B_0X1			(0x1u<<11)
#define	CSI_IER0_SOF2IE_B_0X0			(0x0u<<10)
#define	CSI_IER0_SOF2IE_B_0X1			(0x1u<<10)
#define	CSI_IER0_SOF1IE_B_0X0			(0x0u<<9)
#define	CSI_IER0_SOF1IE_B_0X1			(0x1u<<9)
#define	CSI_IER0_SOF0IE_B_0X0			(0x0u<<8)
#define	CSI_IER0_SOF0IE_B_0X1			(0x1u<<8)
#define	CSI_IER0_TIM3IE_B_0X0			(0x0u<<7)
#define	CSI_IER0_TIM3IE_B_0X1			(0x1u<<7)
#define	CSI_IER0_TIM2IE_B_0X0			(0x0u<<6)
#define	CSI_IER0_TIM2IE_B_0X1			(0x1u<<6)
#define	CSI_IER0_TIM1IE_B_0X0			(0x0u<<5)
#define	CSI_IER0_TIM1IE_B_0X1			(0x1u<<5)
#define	CSI_IER0_TIM0IE_B_0X0			(0x0u<<4)
#define	CSI_IER0_TIM0IE_B_0X1			(0x1u<<4)

// IER1 Configuration

#define	CSI_IER1_ECTRLDL1IE				(0x1u<<12)
#define	CSI_IER1_ESYNCESCDL1IE			(0x1u<<11)
#define	CSI_IER1_EESCDL1IE				(0x1u<<10)
#define	CSI_IER1_ESOTSYNCDL1IE			(0x1u<<9)
#define	CSI_IER1_ESOTDL1IE				(0x1u<<8)
#define	CSI_IER1_ECTRLDL0IE				(0x1u<<4)
#define	CSI_IER1_ESYNCESCDL0IE			(0x1u<<3)
#define	CSI_IER1_EESCDL0IE				(0x1u<<2)
#define	CSI_IER1_ESOTSYNCDL0IE			(0x1u<<1)
#define	CSI_IER1_ESOTDL0IE				(0x1u<<0)

#define	CSI_IER1_ECTRLDL1IE_B_0X0		(0x0u<<12)
#define	CSI_IER1_ECTRLDL1IE_B_0X1		(0x1u<<12)
#define	CSI_IER1_ESYNCESCDL1IE_B_0X0	(0x0u<<11)
#define	CSI_IER1_ESYNCESCDL1IE_B_0X1	(0x1u<<11)
#define	CSI_IER1_EESCDL1IE_B_0X0		(0x0u<<10)
#define	CSI_IER1_EESCDL1IE_B_0X1		(0x1u<<10)
#define	CSI_IER1_ESOTSYNCDL1IE_B_0X0	(0x0u<<9)
#define	CSI_IER1_ESOTSYNCDL1IE_B_0X1	(0x1u<<9)
#define	CSI_IER1_ESOTDL1IE_B_0X0		(0x0u<<8)
#define	CSI_IER1_ESOTDL1IE_B_0X1		(0x1u<<8)
#define	CSI_IER1_ECTRLDL0IE_B_0X0		(0x0u<<4)
#define	CSI_IER1_ECTRLDL0IE_B_0X1		(0x1u<<4)
#define	CSI_IER1_ESYNCESCDL0IE_B_0X0	(0x0u<<3)
#define	CSI_IER1_ESYNCESCDL0IE_B_0X1	(0x1u<<3)
#define	CSI_IER1_EESCDL0IE_B_0X0		(0x0u<<2)
#define	CSI_IER1_EESCDL0IE_B_0X1		(0x1u<<2)
#define	CSI_IER1_ESOTSYNCDL0IE_B_0X0	(0x0u<<1)
#define	CSI_IER1_ESOTSYNCDL0IE_B_0X1	(0x1u<<1)
#define	CSI_IER1_ESOTDL0IE_B_0X0		(0x0u<<0)
#define	CSI_IER1_ESOTDL0IE_B_0X1		(0x1u<<0)

// SR0 Configuration

#define	CSI_SR0_SYNCERRF				(0x1u<<30)
#define	CSI_SR0_WDERRF					(0x1u<<29)
#define	CSI_SR0_SPKTERRF				(0x1u<<28)
#define	CSI_SR0_IDERRF					(0x1u<<27)
#define	CSI_SR0_CECCERRF				(0x1u<<26)
#define	CSI_SR0_ECCERRF					(0x1u<<25)
#define	CSI_SR0_CRCERRF					(0x1u<<24)
#define	CSI_SR0_CCFIFOFF				(0x1u<<21)
#define	CSI_SR0_VC3STATEF				(0x1u<<20)
#define	CSI_SR0_VC2STATEF				(0x1u<<19)
#define	CSI_SR0_VC1STATEF				(0x1u<<18)
#define	CSI_SR0_VC0STATEF				(0x1u<<17)
#define	CSI_SR0_SPKTF					(0x1u<<16)
#define	CSI_SR0_EOF3F					(0x1u<<15)
#define	CSI_SR0_EOF2F					(0x1u<<14)
#define	CSI_SR0_EOF1F					(0x1u<<13)
#define	CSI_SR0_EOF0F					(0x1u<<12)
#define	CSI_SR0_SOF3F					(0x1u<<11)
#define	CSI_SR0_SOF2F					(0x1u<<10)
#define	CSI_SR0_SOF1F					(0x1u<<9)
#define	CSI_SR0_SOF0F					(0x1u<<8)
#define	CSI_SR0_TIM3F					(0x1u<<7)
#define	CSI_SR0_TIM2F					(0x1u<<6)
#define	CSI_SR0_TIM1F					(0x1u<<5)
#define	CSI_SR0_TIM0F					(0x1u<<4)
#define	CSI_SR0_LB3F					(0x1u<<3)
#define	CSI_SR0_LB2F					(0x1u<<2)
#define	CSI_SR0_LB1F					(0x1u<<1)
#define	CSI_SR0_LB0F					(0x1u<<0)

#define	CSI_SR0_VC3STATEF_B_0X0			(0x0u<<20)
#define	CSI_SR0_VC3STATEF_B_0X1			(0x1u<<20)
#define	CSI_SR0_VC2STATEF_B_0X0			(0x0u<<19)
#define	CSI_SR0_VC2STATEF_B_0X1			(0x1u<<19)
#define	CSI_SR0_VC1STATEF_B_0X0			(0x0u<<18)
#define	CSI_SR0_VC1STATEF_B_0X1			(0x1u<<18)
#define	CSI_SR0_VC0STATEF_B_0X0			(0x0u<<17)
#define	CSI_SR0_VC0STATEF_B_0X1			(0x1u<<17)

// SR1 Configuration

#define	CSI_SR1_ACTCLF					(0x1u<<31)
#define	CSI_SR1_ULPNCLF					(0x1u<<30)
#define	CSI_SR1_ULPNACTF				(0x1u<<29)
#define	CSI_SR1_STOPCLF					(0x1u<<28)
#define	CSI_SR1_ULPNDL1F				(0x1u<<26)
#define	CSI_SR1_STOPDL1F				(0x1u<<25)
#define	CSI_SR1_SKCALDL1F				(0x1u<<24)
#define	CSI_SR1_SYNCDL1F				(0x1u<<23)
#define	CSI_SR1_ACTDL1F					(0x1u<<22)
#define	CSI_SR1_ULPNDL0F				(0x1u<<20)
#define	CSI_SR1_STOPDL0F				(0x1u<<19)
#define	CSI_SR1_SKCALDL0F				(0x1u<<18)
#define	CSI_SR1_SYNCDL0F				(0x1u<<17)
#define	CSI_SR1_ACTDL0F					(0x1u<<16)
#define	CSI_SR1_ECTRLDL1F				(0x1u<<12)
#define	CSI_SR1_ESYNCESCDL1F			(0x1u<<11)
#define	CSI_SR1_EESCDL1F				(0x1u<<10)
#define	CSI_SR1_ESOTSYNCDL1F			(0x1u<<9)
#define	CSI_SR1_ESOTDL1F				(0x1u<<8)
#define	CSI_SR1_ECTRLDL0F				(0x1u<<4)
#define	CSI_SR1_ESYNCESCDL0F			(0x1u<<3)
#define	CSI_SR1_EESCDL0F				(0x1u<<2)
#define	CSI_SR1_ESOTSYNCDL0F			(0x1u<<1)
#define	CSI_SR1_ESOTDL0F				(0x1u<<0)

