hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_csi.h
// FCR0 Configuration

#define	CSI_FCR0_CSYNCERRF				(0x1u<<30)
#define	CSI_FCR0_CWDERRF				(0x1u<<29)
#define	CSI_FCR0_CSPKTERRF				(0x1u<<28)
#define	CSI_FCR0_CIDERRF				(0x1u<<27)
#define	CSI_FCR0_CCECCERRF				(0x1u<<26)
#define	CSI_FCR0_CECCERRF				(0x1u<<25)
#define	CSI_FCR0_CCRCERRF				(0x1u<<24)
#define	CSI_FCR0_CCCFIFOFF				(0x1u<<21)
#define	CSI_FCR0_CSPKTF					(0x1u<<16)
#define	CSI_FCR0_CEOF3F					(0x1u<<15)
#define	CSI_FCR0_CEOF2F					(0x1u<<14)
#define	CSI_FCR0_CEOF1F					(0x1u<<13)
#define	CSI_FCR0_CEOF0F					(0x1u<<12)
#define	CSI_FCR0_CSOF3F					(0x1u<<11)
#define	CSI_FCR0_CSOF2F					(0x1u<<10)
#define	CSI_FCR0_CSOF1F					(0x1u<<9)
#define	CSI_FCR0_CSOF0F					(0x1u<<8)
#define	CSI_FCR0_CTIM3F					(0x1u<<7)
#define	CSI_FCR0_CTIM2F					(0x1u<<6)
#define	CSI_FCR0_CTIM1F					(0x1u<<5)
#define	CSI_FCR0_CTIM0F					(0x1u<<4)
#define	CSI_FCR0_CLB3F					(0x1u<<3)
#define	CSI_FCR0_CLB2F					(0x1u<<2)
#define	CSI_FCR0_CLB1F					(0x1u<<1)
#define	CSI_FCR0_CLB0F					(0x1u<<0)

// FCR1 Configuration

#define	CSI_FCR1_CECTRLDL1F				(0x1u<<12)
#define	CSI_FCR1_CESYNCESCDL1F			(0x1u<<11)
#define	CSI_FCR1_CEESCDL1F				(0x1u<<10)
#define	CSI_FCR1_CESOTSYNCDL1F			(0x1u<<9)
#define	CSI_FCR1_CESOTDL1F				(0x1u<<8)
#define	CSI_FCR1_CECTRLDL0F				(0x1u<<4)
#define	CSI_FCR1_CESYNCESCDL0F			(0x1u<<3)
#define	CSI_FCR1_CEESCDL0F				(0x1u<<2)
#define	CSI_FCR1_CESOTSYNCDL0F			(0x1u<<1)
#define	CSI_FCR1_CESOTDL0F				(0x1u<<0)

// SPDFR Configuration

#define	CSI_SPDFR_VCHANNEL				(0x3u<<22)
#define	CSI_SPDFR_VCHANNEL_0			(0x1u<<22)
#define	CSI_SPDFR_DATATYPE				(0x3Fu<<16)
#define	CSI_SPDFR_DATATYPE_0			(0x1u<<16)
#define	CSI_SPDFR_DATAFIELD				(0xFFFFu<<0)
#define	CSI_SPDFR_DATAFIELD_0			(0x1u<<0)

// ERR1 Configuration

#define	CSI_ERR1_IDVCERR				(0x3u<<22)
#define	CSI_ERR1_IDVCERR_0				(0x1u<<22)
#define	CSI_ERR1_IDDTERR				(0x3Fu<<16)
#define	CSI_ERR1_IDDTERR_0				(0x1u<<16)
#define	CSI_ERR1_CECCVCERR				(0x3u<<14)
#define	CSI_ERR1_CECCVCERR_0			(0x1u<<14)
#define	CSI_ERR1_CECCDTERR				(0x3Fu<<8)
#define	CSI_ERR1_CECCDTERR_0			(0x1u<<8)
#define	CSI_ERR1_CRCVCERR				(0x3u<<6)
#define	CSI_ERR1_CRCVCERR_0				(0x1u<<6)
#define	CSI_ERR1_CRCDTERR				(0x3Fu<<0)
#define	CSI_ERR1_CRCDTERR_0				(0x1u<<0)

// ERR2 Configuration

#define	CSI_ERR2_SYNCVCERR				(0x3u<<18)
#define	CSI_ERR2_SYNCVCERR_0			(0x1u<<18)
#define	CSI_ERR2_WDVCERR				(0x3u<<16)
#define	CSI_ERR2_WDVCERR_0				(0x1u<<16)
#define	CSI_ERR2_SPKTVCERR				(0x3u<<6)
#define	CSI_ERR2_SPKTVCERR_0			(0x1u<<6)
#define	CSI_ERR2_SPKTDTERR				(0x3Fu<<0)
#define	CSI_ERR2_SPKTDTERR_0			(0x1u<<0)

// PRCR Configuration

#define	CSI_PRCR_PEN					(0x1u<<1)

#define	CSI_PRCR_PEN_B_0X0				(0x0u<<1)
#define	CSI_PRCR_PEN_B_0X1				(0x1u<<1)

// PMCR Configuration

#define	CSI_PMCR_TUEXDL0				(0x1u<<16)
#define	CSI_PMCR_TUESDL0				(0x1u<<12)
#define	CSI_PMCR_RTDL0					(0x1u<<8)
#define	CSI_PMCR_DTDL					(0x1u<<4)
#define	CSI_PMCR_FTXSMDL0				(0x1u<<2)
#define	CSI_PMCR_FRXMDL1				(0x1u<<1)
#define	CSI_PMCR_FRXMDL0				(0x1u<<0)

#define	CSI_PMCR_RTDL0_B_0X0			(0x0u<<8)
#define	CSI_PMCR_RTDL0_B_0X1			(0x1u<<8)
#define	CSI_PMCR_DTDL_B_0X0				(0x0u<<4)
#define	CSI_PMCR_DTDL_B_0X1				(0x1u<<4)
#define	CSI_PMCR_FTXSMDL0_B_0X0			(0x0u<<2)
#define	CSI_PMCR_FTXSMDL0_B_0X1			(0x1u<<2)
#define	CSI_PMCR_FRXMDL1_B_0X0			(0x0u<<1)
#define	CSI_PMCR_FRXMDL1_B_0X1			(0x1u<<1)
#define	CSI_PMCR_FRXMDL0_B_0X0			(0x0u<<0)
#define	CSI_PMCR_FRXMDL0_B_0X1			(0x1u<<0)

// PFCR Configuration

#define	CSI_PFCR_DLD					(0x1u<<16)
#define	CSI_PFCR_HSFR					(0x7Fu<<8)
#define	CSI_PFCR_HSFR_0					(0x1u<<8)
#define	CSI_PFCR_CCFR					(0x3Fu<<0)
#define	CSI_PFCR_CCFR_0					(0x1u<<0)

#define	CSI_PFCR_DLD_B_0X0				(0x0u<<16)
#define	CSI_PFCR_DLD_B_0X1				(0x1u<<16)

// PTCR0 Configuration

#define	CSI_PTCR0_TRSEN					(0x1u<<1)
#define	CSI_PTCR0_TCKEN					(0x1u<<0)

// PTCR1 Configuration

#define	CSI_PTCR1_TWM					(0x1u<<16)
#define	CSI_PTCR1_TDI					(0xFFu<<0)
#define	CSI_PTCR1_TDI_0					(0x1u<<0)

#define	CSI_PTCR1_TWM_B_0X0				(0x0u<<16)
#define	CSI_PTCR1_TWM_B_0X1				(0x1u<<16)

// PTSR Configuration

#define	CSI_PTSR_TDO					(0xFFu<<0)
#define	CSI_PTSR_TDO_0					(0x1u<<0)
